# Merge Dataframes:

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv("Mall_1.csv") #importing the datas from file to python

In [3]:
df1

   customer_id  gender  age  annual_income  spending_score(1-100
0            1    male   19             15                    30
1            2    male   21             15                    81
2            3  female   20             16                     6
3            4  female   23             16                    77
4            5  female   31             17                    40

In [4]:
df2 = pd.read_csv("Mall_2.csv") #importing files

In [5]:
df2

   customer_id         area
0            1  narayangarh
1            2    medinipur
2            3    kharagpur
3            4        belda
4            5        datan

In [6]:
df3 = pd.merge(df1,df2,on = "customer_id") #merging dataframe df1 and df2 in df3

In [7]:
df3

   customer_id  gender  age  annual_income  spending_score(1-100         area
0            1    male   19             15                    30  narayangarh
1            2    male   21             15                    81    medinipur
2            3  female   20             16                     6    kharagpur
3            4  female   23             16                    77        belda
4            5  female   31             17                    40        datan

# How Keyword

In [8]:
#NOTE:
#suppose among the above both datasets,  if mall_1 has 5 datas and mall_2 has 6 datas after merging the extra outcast data wont be displayed.
#Now if we want to display the outcast data along with other datas we use how keyyword
# df3 = pd.merge(df1,df2,on = "customer_id",how = "outer")
#here inner and outer represents the sets intersection and union respectivly.
#by default datas will be merged using intersection rule but if we mention how keyword then the datas will be merged in union rule

In [9]:
 #we can use how = "left" and how = "right" it will priotarize the data on left and right side
# If we use after how keyword, indicator = true ,it will create a diff column which indicates the type of joining
#example:

In [14]:
df3 = pd.merge(df1,df2,on = "customer_id",how = "inner",indicator = True)
df3

,customer_id,gender,age,annual_income,spending_score(1-100,area,_merge
0,1,male,19,15,30,narayangarh,both
1,2,male,21,15,81,medinipur,both
2,3,female,20,16,6,kharagpur,both
3,4,female,23,16,77,belda,both
4,5,female,31,17,40,datan,both

In [ ]:
#above merge column is created extra due to indicator keyword.